core/app/Http/Controllers/SiteController.php

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = '/' limit 1
select * from `general_settings` where `id` = 1 limit 1
---
    public function index()
    {
        $pageTitle = 'Home';
        $sections  = Page::where('tempname', $this->activeTemplate)->where('slug', '/')->first();
        $whatsapp_link = GeneralSetting::where('id', 1)->first()->whatsapp_link;

select * from `pages` where `tempname` = 'templates.basic.' and `slug` = 'check-auth' limit 1
---
    public function pages($slug)
    {
        $page      = Page::where('tempname', $this->activeTemplate)->where('slug', $slug)->firstOrFail();