core/app/Http/Controllers/Gateway/PaymentController.php

select * from `gateway_currencies` where exists (select * from `gateways` where `gateway_currencies`.`method_code` = `gateways`.`code` and `status` = 1) order by `method_code` asc
---
    public function deposit()
    {
        $gatewayCurrency = GatewayCurrency::whereHas('method', function ($gate) {
            $gate->where('status', Status::ENABLE);
        })->with('method')->orderby('method_code')->get();

select * from `deposits` where `status` = 0 and `trx` is null limit 1
---
        function manualDepositConfirm()
        {
            $track = session()->get('Track');
            $data = Deposit::with('gateway')->where('status', Status::PAYMENT_INITIATE)->where('trx', $track)->first();

update `deposits` set `status` = 2, `url` = 'http://mydevhost.com/assets/verify/2024/05/03/24052856FreeVector-Wine-Vector.jpg', `deposits`.`updated_at` = '2024-05-03 20:28:56' where `trx` is null
select * from `users` where `id` = 3 limit 1
insert into `admin_notifications` (`user_id`, `title`, `click_url`, `updated_at`, `created_at`) values (3, 'Payment request from toluadejimi', 'http://mydevhost.com/assets/verify/2024/05/03/24052856FreeVector-Wine-Vector.jpg', '2024-05-03 20:28:56', '2024-05-03 20:28:56')
---
    public function manualDepositUpdate(Request $request)
    {


        $file = $request->file('receipt');
        $receipt_fileName = date("ymis") . $file->getClientOriginalName();
        $directory = date("Y")."/".date("m")."/".date("d");
        $path = getFilePath('verify').'/'.$directory;
        $request->receipt->move($path, $receipt_fileName);
        $url = url('')."/".$path."/".$receipt_fileName;




        Deposit::where('trx', $request->ref)->update([
            'status' => 2,
            'url' => $url,
        ]);



        $email = User::where('id', Auth::id())->first()->email;

        $adminNotification = new AdminNotification();
        $adminNotification->user_id = Auth::id();
        $adminNotification->title = 'Payment request from '.Auth::user()->username;
        $adminNotification->click_url = $url;
        $adminNotification->save();