core/app/Http/Controllers/User/OrderController.php

	public function history()
	{
		$pageTitle = 'Order History';
		$orders    = $this->orderData();
        $pending_orders = Order::where('user_id', Auth::id())->with(['category', 'user', 'service'])->where('status', 0)->paginate('10');
        $completed_orders = Order::where('user_id', Auth::id())->with(['category', 'user', 'service'])->where('status', 2)->paginate('10');

        $completed_order = Order::where('user_id', Auth::id())->with(['category', 'user', 'service'])->where('status', 2)->count();

        $total_order = Order::where('user_id', Auth::id())->with(['category', 'user', 'service'])->count();

        $bought = Order::where('user_id', Auth::id())->with(['category', 'user', 'service'])->where('status', 2)->sum('price');
---
select * from `categories` where `categories`.`id` in (12)
select * from `orders` where `user_id` = 3 and `status` = 0 limit 10 offset 0
select * from `services` where `services`.`id` in (83)
select * from `users` where `users`.`id` in (3)
select * from `categories` where `categories`.`id` in (21)
select * from `orders` where `user_id` = 3 and `status` = 2 limit 10 offset 0
select * from `services` where `services`.`id` in (128)
select count(*) as aggregate from `orders` where `user_id` = 1 and `status` = 2
select count(*) as aggregate from `orders` where `user_id` = 1
select sum(`price`) as aggregate from `orders` where `user_id` = 1 and `status` = 2

	protected function orderData($scope = null)
	{

		if ($scope) {
			$orders = Order::$scope();
		} else {
			$orders = Order::query();
		}

		return $orders->where('user_id', auth()->id())->searchable(['category:name', 'service:name'])->with(['category', 'user', 'service'])->orderBy('id', 'desc')->paginate(getPaginate());
---
select * from `categories` where `categories`.`id` in (12, 82)
select * from `orders` where `user_id` = 1 and (exists (select * from `categories` where `orders`.`category_id` = `categories`.`id` and `name` like '%%') or exists (select * from `services` where `orders`.`service_id` = `services`.`id` and `name` like '%%')) order by `id` desc limit 20 offset 0
select * from `services` where `services`.`id` in (83, 311)
select * from `users` where `users`.`id` in (1)