core/app/Http/Controllers/User/UserController.php

select * from `orders` where `user_id` = 3 and `status` = 0
select sum(`price`) as aggregate from `orders` where `status` != 4 and `user_id` = 1
select count(*) as aggregate from `transactions` where `user_id` = 1
select count(*) as aggregate from `orders` where `user_id` = 1
select count(*) as aggregate from `support_tickets` where `user_id` = 1
select * from `transactions` where `user_id` = 1 and (`trx` LIKE '%%') order by `id` desc limit 20 offset 0
select count(*) as aggregate from `transactions` where `user_id` = 1 and (`trx` LIKE '%%')
select * from `orders` where `user_id` = 1 limit 20 offset 0
select * from `general_settings` where `id` = 1 limit 1
---
    public function home()
    {

        $widget['pageTitle ']                 = 'Dashboard';
        $user                        = auth()->user();
        $widget['balance']           = $user->balance;
        $widget['total_spent']       = Order::where('status', '!=', Status::ORDER_REFUNDED)->where('user_id', $user->id)->sum('price');
        $widget['total_transaction'] = Transaction::where('user_id', $user->id)->count();
        $widget['total_order']       = Order::where('user_id', $user->id)->count();
        $widget['pending_order']     = Order::where('user_id', $user->id)->pending()->count();
        $widget['processing_order']  = Order::where('user_id', $user->id)->processing()->count();
        $widget['completed_order']   = Order::where('user_id', $user->id)->completed()->count();
        $widget['cancelled_order']   = Order::where('user_id', $user->id)->cancelled()->count();
        $widget['refunded_order']    = Order::where('user_id', $user->id)->refunded()->count();
        $widget['deposit']           = Deposit::successful()->where('user_id', $user->id)->sum('amount');
        $widget['total_service']     = Service::active()->count();
        $widget['total_ticket']      = SupportTicket::where('user_id', $user->id)->count();
        $widget['transactions ']= Transaction::where('user_id', auth()->id())->searchable(['trx'])->filter(['trx_type', 'remark'])->orderBy('id', 'desc')->paginate(getPaginate());
        $widget['orders']       = Order::where('user_id', $user->id)->paginate(getPaginate());

        $widget['categories'] = Category::active()->whereHas('services', function ($services) {
            return $services->active();
        })->orderBy('name')->get();

        $widget['whatsapp_link']  = GeneralSetting::where('id', 1)->first()->whatsapp_link;

        $widget['pending']= Order::where('user_id', $user->id)->pending()->get();

        $whatsapp_link = GeneralSetting::where('id', 1)->first()->whatsapp_link;

select distinct `remark` from `transactions` order by `remark` asc
select count(*) as aggregate from `transactions` where `user_id` = 3 and (`trx` LIKE '%%')
---
    public function transactions(Request $request)
    {
        $pageTitle    = 'Transactions';
        $remarks      = Transaction::distinct('remark')->orderBy('remark')->get('remark');
        $transactions = Transaction::where('user_id', auth()->id())->searchable(['trx'])->filter(['trx_type', 'remark'])->orderBy('id', 'desc')->paginate(getPaginate());

select * from `services` order by `created_at` desc limit 20 offset 0
select count(*) as aggregate from `services`
select * from `general_settings` where `id` = 1 limit 1
---
    public function services()
    {
        $pageTitle  = 'Services';
        $categories = Category::active()->whereHas('services', function ($services) {
            return $services->active();
        })->orderBy('name')->get();

        $service = Service::paginate(20);

        $whatsapp_link = GeneralSetting::where('id', 1)->first()->whatsapp_link;